{"accounts": {"1": {"username": "poopop", "password": "deec2e520eedb7effff7ba6d4e821ee2387c6c959c435c5bda31c25bcf6c0259", "messages": [{"id": 0, "sender": "bob", "subject": "no", "message": "no", "date": "07/09/2021", "time": "5:33 PM", "read": true, "encrypted": "", "password": "haha"}, {"id": 1, "sender": "test", "subject": "secret message wow!", "message": "Four score and seven years ago our fathers brought forth on this continent, a new nation, conceived in Liberty, and dedicated to the proposition that all men are created equal.\r\n\r\nNow we are engaged in a great civil war, testing whether that nation, or any nation so conceived and so dedicated, can long endure. We are met on a great battle-field of that war. We have come to dedicate a portion of that field, as a final resting place for those who here gave their lives that that nation might live. It is altogether fitting and proper that we should do this.\r\n\r\nBut, in a larger sense, we can not dedicate -- we can not consecrate -- we can not hallow -- this ground. The brave men, living and dead, who struggled here, have consecrated it, far above our poor power to add or detract. The world will little note, nor long remember what we say here, but it can never forget what they did here. It is for us the living, rather, to be dedicated here to the unfinished work which they who fought here have thus far so nobly advanced. It is rather for us to be here dedicated to the great task remaining before us -- that from these honored dead we take increased devotion to that cause for which they gave the last full measure of devotion -- that we here highly resolve that these dead shall not have died in vain -- that this nation, under God, shall have a new birth of freedom -- and that government of the people, by the people, for the people, shall not perish from the earth.\r\n\r\n", "date": "07/23/2021", "time": "6:21 PM", "read": true, "encrypted": "on", "password": "b822f1cd2dcfc685b47e83e3980289fd5d8e3ff3a82def24d7d1d68bb272eb32"}], "current_id": 2}, "2": {"username": "bob", "password": "37fe9a12c78bc144ea5eecce3de21b396f19b462a359b19c3291d1d161d95ea6", "messages": [{"id": 0, "sender": "poopop", "subject": "sup", "message": "I'm better than you at super smash bros", "date": "06/25/2021", "time": "6:24 PM", "read": true, "encrypted": "", "password": ""}, {"id": 1, "sender": "Sunny-d", "subject": "New account", "message": "Message me here please, not on poopop, thank you!", "date": "07/24/2021", "time": "0:24 AM", "read": false, "encrypted": null, "password": "e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855"}], "current_id": 2}, "3": {"username": "test", "password": "ecd71870d1963316a97e3ac3408c9835ad8cf0f3c1bc703527c30265534f75ae", "messages": [{"id": 0, "sender": "poopop", "subject": "hello", "message": "This is TALK OF THE NATION. I'm Rebecca Roberts in Washington.\r\n\r\nToday, we celebrate the birthday of Martin Luther King Jr. As millions of Americans honor his legacy today with a national day of service, we take a moment to reflect on Dr. King's life and message with his own words. As we did last year on the eve of a historic presidential inauguration, we now revisit King's celebrated \"I Have a Dream\" speech, delivered on August 28, 1963 on the steps of the Lincoln Memorial.\r\n\r\nSOUNDBITE OF ARCHIVED RECORDING\r\n\r\nDr. MARTIN LUTHER KING JR. (Civil Rights Leader): Five score years ago, a great American, in whose symbolic shadow we stand today, signed the Emancipation Proclamation. This momentous decree came as a great beacon light of hope to millions of Negro slaves who had been seared in the flames of withering injustice. It came as a joyous daybreak to end the long night of their captivity.\r\n\r\nBut 100 years later, the Negro still is not free. One hundred years later, the life of the Negro is still sadly crippled by the manacles of segregation and the chains of discrimination. One hundred years later, the Negro lives on a lonely island of poverty in the midst of a vast ocean of material prosperity. One hundred years later...\r\n\r\nSOUNDBITE OF APPLAUSE\r\n\r\nDr. KING: ...the Negro is still languished in the corners of American society and finds himself in exile in his own land. And so we've come here today to dramatize a shameful condition. In a sense we've come to our nation's capital to cash a check. When the architects of our republic wrote the magnificent words of the Constitution and the Declaration of Independence, they were signing a promissory note to which every American was to fall heir. This note was a promise that all men - yes, black men as well as white men - would be guaranteed the unalienable rights of life, liberty and the pursuit of happiness.\r\n\r\nIt is obvious today that America has defaulted on this promissory note insofar as her citizens of color are concerned. Instead of honoring this sacred obligation, America has given the Negro people a bad check, a check which has come back marked insufficient funds.\r\n\r\nSOUNDBITE OF APPLAUSE\r\n\r\nDr. KING: But we refuse to believe that the bank of justice is bankrupt.\r\n\r\nSOUNDBITE OF LAUGHTER\r\n\r\nDr. KING: We refuse to believe that there are insufficient funds in the great vaults of opportunity of this nation. And so we've come to cash this check, a check that will give us upon demand the riches of freedom and the security of justice.\r\n\r\nSOUNDBITE OF APPLAUSE\r\n\r\nDr. KING: We have also come to his hallowed spot to remind America of the fierce urgency of now. This is no time to engage in the luxury of cooling off or to take the tranquilizing drug of gradualism.\r\n\r\nSOUNDBITE OF APPLAUSE\r\n\r\nDr. KING: Now is the time to make real the promises of democracy. Now is the time to rise from the dark and desolate valley of segregation to the sunlit path of racial justice. Now is the time...\r\n\r\nSOUNDBITE OF APPLAUSE\r\n\r\nDr. KING: ...to lift our nation from the quick sands of racial injustice to the solid rock of brotherhood. Now is the time to make justice a reality for all of God's children.\r\n\r\nIt would be fatal for the nation to overlook the urgency of the moment. This sweltering summer of the Negro's legitimate discontent will not pass until there is an invigorating autumn of freedom and equality. 1963 is not an end, but a beginning. Those who hope that the Negro needed to blow off steam and will now be content will have a rude awakening if the nation returns to business as usual.\r\n\r\nSOUNDBITE OF APPLAUSE\r\n\r\nDr. KING: There will be neither rest nor tranquility in America until the Negro is granted his citizenship rights. The whirlwinds of revolt will continue to shake the foundations of our nation until the bright day of justice emerges.\r\n\r\nBut there is something that I must say to my people who stand on the warm threshold which leads into the palace of justice. In the process of gaining our rightful place, we must not be guilty of wrongful deeds. Let us not seek to satisfy our thirst for freedom by drinking from the cup of bitterness and hatred.\r\n\r\nSOUNDBITE OF APPLAUSE\r\n\r\nDr. KING: We must forever conduct our struggle on the high plane of dignity and discipline. We must not allow our creative protest to degenerate into physical violence. Again and again, we must rise to the majestic heights of meeting physical force with soul force. The marvelous new militancy which has engulfed the Negro community must not lead us to a distrust of all white people, for many of our white brothers, as evidenced by their presence here today, have come to realize that their destiny is tied up with our destiny.\r\n\r\nSOUNDBITE OF APPLAUSE\r\n\r\nDr. KING: And they have come to realize that their freedom is inextricably bound to our freedom. We cannot walk alone. And as we walk, we must make the pledge that we shall always march ahead. We cannot turn back.\r\n\r\nThere are those who are asking the devotees of civil rights, when will you be satisfied? We can never be satisfied as long as the Negro is the victim of the unspeakable horrors of police brutality. We can never be satisfied as long as our bodies, heavy with the fatigue of travel, cannot gain lodging in the motels of the highways and the hotels of the cities.\r\n\r\nSOUNDBITE OF APPLAUSE\r\n\r\nDr. KING: We cannot be satisfied as long as the Negro's basic mobility is from a smaller ghetto to a larger one. We can never be satisfied as long as our children are stripped of their selfhood and robbed of their dignity by signs stating: for whites only.\r\n\r\nSOUNDBITE OF APPLAUSE\r\n\r\nDr. KING: We cannot be satisfied as long as a Negro in Mississippi cannot vote and a Negro in New York believes he has nothing for which to vote.\r\n\r\nSOUNDBITE OF APPLAUSE\r\n\r\nDr. KING: No, no, we are not satisfied, and we will not be satisfied until justice rolls down like waters, and righteousness like a mighty stream.\r\n\r\nSOUNDBITE OF APPLAUSE\r\n\r\nDr. KING: I am not unmindful that some of you have come here out of great trials and tribulations. Some of you have come fresh from narrow jail cells. Some of you have come from areas where your quest for freedom left you battered by the storms of persecution and staggered by the winds of police brutality. You have been the veterans of creative suffering. Continue to work with the faith that unearned suffering is redemptive. Go back to Mississippi, go back to Alabama, go back to South Carolina, go back to Georgia, go back to Louisiana, go back to the slums and ghettos of our Northern cities, knowing that somehow this situation can and will be changed.\r\n\r\nLet us not wallow in the valley of despair, I say to you today, my friends.\r\n\r\nSOUNDBITE OF APPLAUSE\r\n\r\nDr. KING: So even though we face the difficulties of today and tomorrow, I still have a dream. It is a dream deeply rooted in the American dream. I have a dream that one day this nation will rise up and live out the true meaning of its creed: We hold these truths to be self-evident, that all men are created equal.\r\n\r\nSOUNDBITE OF APPLAUSE\r\n\r\nDr. KING: I have a dream that one day on the red hills of Georgia, the sons of former slaves and the sons of former slave owners will be able to sit down together at the table of brotherhood.\r\n\r\nI have a dream that one day even the state of Mississippi, a state sweltering with the heat of injustice, sweltering with the heat of oppression will be transformed into an oasis of freedom and justice.\r\n\r\nI have a dream that my four little children will one day live in a nation where they will not be judged by the color of their skin but by the content of their character. I have a dream today.\r\n\r\nSOUNDBITE OF APPLAUSE\r\n\r\nDr. KING: I have a dream that one day down in Alabama with its vicious racists, with its governor having his lips dripping with the words of interposition and nullification, one day right down in Alabama little black boys and black girls will be able to join hands with little white boys and white girls as sisters and brothers. I have a dream today.\r\n\r\nSOUNDBITE OF CHEERS AND APPLAUSE\r\n\r\nDr. KING: I have a dream that one day every valley shall be exalted, every hill and mountain shall be made low, the rough places will be made plain, and the crooked places will be made straight, and the glory of the Lord shall be revealed, and all flesh shall see it together.\r\n\r\nThis is our hope. This is the faith that I go back to the South with. With this faith, we will be able to hew out of the mountain of despair a stone of hope. With this faith we will be able to transform the jangling discords of our nation into a beautiful symphony of brotherhood. With this faith we will be able to work together, to pray together, to struggle together, to go to jail together, to stand up for freedom together, knowing that we will be free one day.\r\n\r\nSOUNDBITE OF APPLAUSE\r\n\r\nDr. KING: This will be the day when all of God's children will be able to sing with new meaning: My country, 'tis of thee, sweet land of liberty, of thee I sing. Land where my fathers died, land of the pilgrims' pride, from every mountainside, let freedom ring.", "date": "07/23/2021", "time": "6:28 PM", "read": true, "encrypted": "on", "password": "d53d8d0632cd64e595b2cc9709bd580e4d323cd65ebbfaa778b3252c761ba1b8"}, {"id": 1, "sender": "poopop", "subject": "hello", "message": "hi I am poopop", "date": "07/23/2021", "time": "6:31 PM", "read": true, "encrypted": null, "password": "e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855"}], "current_id": 2}, "4": {"username": "Sunny-d", "password": "943a537eb9d738e36b0a0ecde91bc05bbe902067c6d580dcbee11c9481bf8d16", "messages": [{"id": 0, "sender": "tarveen1818", "subject": "Hello", "message": "I'm going to kill you in your sleep one day ;)", "date": "07/24/2021", "time": "0:22 AM", "read": true, "encrypted": null, "password": "e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855"}], "current_id": 1}, "5": {"username": "tarveen1818", "password": "6a582d924f61e58e21b994e3eae11f3e4c5d019bd8c4d277ef8344fdbc85cee6", "messages": [{"id": 0, "sender": "Sunny-d", "subject": "HI MOM", "message": "HELLO MOTHER, please don't kill me in my sleep, thank you, from your loving son, Sanu ;)", "date": "07/24/2021", "time": "0:25 AM", "read": true, "encrypted": null, "password": "e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855"}], "current_id": 1}}}